
## Plan Result (terraform/env)

[CI link](https://github.com/team-all-in/all-in/actions/runs/10869933984)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * aws_apprunner_service.all_in_api_slack


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_apprunner_service.all_in_api_slack is tainted, so must be replaced
-/+ resource "aws_apprunner_service" "all_in_api_slack" {
      ~ arn                            = "arn:aws:apprunner:ap-northeast-1:451153100141:service/all_in_slack/596e88748c25434aac852bf489d76fc9" -> (known after apply)
      ~ auto_scaling_configuration_arn = "arn:aws:apprunner:ap-northeast-1:451153100141:autoscalingconfiguration/DefaultConfiguration/1/00000000000000000000000000000001" -> (known after apply)
      ~ id                             = "arn:aws:apprunner:ap-northeast-1:451153100141:service/all_in_slack/596e88748c25434aac852bf489d76fc9" -> (known after apply)
      ~ service_id                     = "596e88748c25434aac852bf489d76fc9" -> (known after apply)
      ~ service_url                    = "dnpmdyak8c.ap-northeast-1.awsapprunner.com" -> (known after apply)
      ~ status                         = "CREATE_FAILED" -> (known after apply)
        tags                           = {
            "Name" = "slack-all-in-apprunner-service"
        }
        # (2 unchanged attributes hidden)

      - health_check_configuration {
          - healthy_threshold   = 1 -> null
          - interval            = 5 -> null
          - path                = "/" -> null
          - protocol            = "TCP" -> null
          - timeout             = 2 -> null
          - unhealthy_threshold = 5 -> null
        }

      ~ instance_configuration {
          ~ cpu               = "512" -> "0.5 vCPU"
          ~ memory            = "1024" -> "1 GB"
            # (1 unchanged attribute hidden)
        }

      - network_configuration {
          - ip_address_type = "IPV4" -> null

          - egress_configuration {
              - egress_type = "DEFAULT" -> null
            }

          - ingress_configuration {
              - is_publicly_accessible = true -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":111,"Program":"tfcmt","SHA1":"33755a86ac4abf348d9fc8ae655e6cbe3c7ac7da","Target":"terraform/env","Vars":{},"WorkflowName":"pull_request_target"} -->